//Все подсказки здесь созданы для себя, которые будут корректироваться в ходе обучения.
//На корректность кода в данном файле не претендую!

console.log('Hello!');
// добавлена скрытая строка
/* скрытие для бодьших текстов или кусков кода */
console.log('This is my first steps in JavaScript');

//вывод переменных
var name; //объявление переменной (1 способ)
name = 'Woronokin'; //присваивание 
console.log(name); //вывод переменной
var	name = 'Philipp' //присваиваем другое значение переменной
console.log(name); //вывод переменной
var greeting = 'Hello' + ' ' + 'World'; //склеивание строк - коекатенация (2 способ)
console.log(greeting); //вывод  переменной
var greeting = 'Hello'; 
greeting += ' World'; // альтернатива greeting = greeting + ' World!'; (3 способ)
console.log(greeting);

2+2  // Сложение
10-8 // Вычитание
24*4 // Умножение
60/5 // деление
60%7 // остаток от деления

1>2  // больше
2<3  // меньше
5>=6 // больше или равно
6<=7 // меньше или равно
8==8 // равно - Boolean true (сравнение: == , присваивание: = . Не путать)
9!=10 // не равно - Boolean false
